### Lecture 26: Handling Date & Time

Importing Libraries

In [1]:
import pandas as pd
import numpy as np

Importing Data

In [2]:
df=pd.read_csv('database.csv',usecols=['Date','Time'])
df.head()

         Date      Time
0  01/02/1965  13:44:18
1  01/04/1965  11:29:49
2  01/05/1965  18:05:58
3  01/08/1965  18:49:43
4  01/09/1965  13:32:50

Checking Type of columns

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 23412 entries, 0 to 23411
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    23412 non-null  object
 1   Time    23412 non-null  object
dtypes: object(2)
memory usage: 365.9+ KB

In [4]:
# As here type is object so we can't do date related stuff so for that change it to data
df['Date'] = pd.to_datetime(df['Date'], errors='coerce')
df['Time'] = pd.to_datetime(df['Time'],format='%H:%M:%S', errors='coerce')

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 23412 entries, 0 to 23411
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    23409 non-null  datetime64[ns]
 1   Time    23409 non-null  datetime64[ns]
dtypes: datetime64[ns](2)
memory usage: 365.9 KB

## Date Functions

Extract Year

In [6]:
df['Year']=df['Date'].dt.year
df.sample(4)

            Date                Time    Year
2046  1971-08-10 1900-01-01 14:37:56  1971.0
3319  1974-12-05 1900-01-01 11:57:31  1974.0
17064 2004-12-13 1900-01-01 12:00:12  2004.0
49    1965-02-08 1900-01-01 15:46:52  1965.0

Extract Month

In [7]:
df['Month']=df['Date'].dt.month

Extarct Month Name

In [8]:
df['Month_Name']=df['Date'].dt.month_name()

In [9]:
df.sample(5)

            Date                Time    Year  Month Month_Name
14470 1999-08-12 1900-01-01 05:45:00  1999.0    8.0     August
11629 1993-09-29 1900-01-01 09:39:21  1993.0    9.0  September
5554  1980-06-11 1900-01-01 14:21:19  1980.0    6.0       June
10940 1992-06-03 1900-01-01 01:55:13  1992.0    6.0       June
18132 2006-11-15 1900-01-01 21:35:10  2006.0   11.0   November

Extract Days

In [10]:
df['Day']=df['Date'].dt.day

Extracting Day of week

In [11]:
df['Day_of_week']=df['Date'].dt.day_of_week

In [12]:
df.head()

        Date                Time    Year  Month Month_Name  Day  Day_of_week
0 1965-01-02 1900-01-01 13:44:18  1965.0    1.0    January  2.0          5.0
1 1965-01-04 1900-01-01 11:29:49  1965.0    1.0    January  4.0          0.0
2 1965-01-05 1900-01-01 18:05:58  1965.0    1.0    January  5.0          1.0
3 1965-01-08 1900-01-01 18:49:43  1965.0    1.0    January  8.0          4.0
4 1965-01-09 1900-01-01 13:32:50  1965.0    1.0    January  9.0          5.0

Extract week of the year

In [13]:
df['Week']=df['Date'].dt.day_of_week

Extract Quarter

In [14]:
df['Quarter']=df['Date'].dt.quarter

Extract Semester

In [15]:
df['Semester']=np.where(df['Quarter'].isin([1,2]),1,2)

Checking weekend

In [16]:
df['Is_weekend']=np.where(df['Day_of_week'].isin(['Saturday','Sunday']),1,0)

In [17]:
df.sample(5)

,Date,Time,Year,Month,Month_Name,Day,Day_of_week,Week,Quarter,Semester,Is_weekend
18781,2007-12-12,1900-01-01 23:40:00,2007.0,12.0,December,12.0,2.0,2.0,4.0,2,0
13170,1996-08-28,1900-01-01 16:53:12,1996.0,8.0,August,28.0,2.0,2.0,3.0,2,0
9453,1989-05-01,1900-01-01 08:45:22,1989.0,5.0,May,1.0,0.0,0.0,2.0,1,0
12841,1996-01-01,1900-01-01 22:41:58,1996.0,1.0,January,1.0,0.0,0.0,1.0,1,0
12261,1995-01-12,1900-01-01 10:26:47,1995.0,1.0,January,12.0,3.0,3.0,1.0,1,0

## Time Functions

In [18]:
import datetime

Getting present date, time

In [19]:
today=datetime.datetime.today()
print(today)

2025-08-07 10:41:38.727576

Extracting Hours, Minutes & Seconds

In [20]:
df['Hr']=df['Time'].dt.hour
df['Min']=df['Time'].dt.minute
df['Sec']=df['Time'].dt.second

In [21]:
df.sample(2)

,Date,Time,Year,Month,Month_Name,Day,Day_of_week,Week,Quarter,Semester,Is_weekend,Hr,Min,Sec
9482,1989-05-21,1900-01-01 19:30:07,1989.0,5.0,May,21.0,6.0,6.0,2.0,1,0,19.0,30.0,7.0
6909,1984-02-03,1900-01-01 19:05:36,1984.0,2.0,February,3.0,4.0,4.0,1.0,1,0,19.0,5.0,36.0